<?php
/**
 * 药品单位
 */

namespace app\common;

class DrugUnit
{

    static $message = [
        1 => 'g',
        2 => 'mg',
        3 => 'ml',
        4 => 'ug',
        5 => 'U',
        6 => 'IIU',
        7 => 'IU',
        8 => '个',
        9 => '丸',
        10 => '包',
        11 => '只',
        12 => '支',
        13 => '枚',
        14 => '片',
        15 => '瓶',
        16 => '粒',
        17 => '袋',
        18 => '贴',
        19 => '板',
        20 => '盒',
        21 => '套',
        22 => '箱',
        23 => '罐',
        24 => '单位',
        25 => '万单位'
    ];

}
