<?php
/**
 * 处方药品用法
 */

namespace app\common;

class NoteUsage
{

    static $message = [
        /* 西药方用法 */
        1 => '口服',
        2 => '静滴',
        3 => '静脉注射',
        4 => '肌肉注射',
        5 => '续滴',
        6 => '外用',
        7 => '冲服',
        8 => '含服',
        9 => '滴眼',
        10 => '雾化吸入',
        11 => '滴鼻',
        12 => '饭后服',
        13 => '喷喉',
        14 => '塞肛用',
        15 => '皮下注射',
        16 => '喷鼻',
        17 => '外洗',
        18 => '舌下含服',
        19 => '外敷',
        20 => '含漱',
        21 => '饭前服',
        22 => '灌肠',
        23 => '阴道用',
        24 => '嚼服',
        25 => '皮内注射',
        26 => '皮试',
        27 => '滴耳',
        28 => '吸入',
        29 => '空腹服',
        30 => '磨粉',
        31 => '水煎服',
        32 => '烊化（服）',
        33 => '入壶',
        34 => '晨服',
        35 => '关节腔注射',
        36 => '冲管',
        37 => '穴位注射',
        38 => '局麻',
        39 => '直肠给药',
        40 => '脱敏注射',
        41 => '坐浴',
        42 => '外涂',
        43 => '洗鼻',
        44 => '超声导入',
        45 => '静滴续滴',
        46 => '微量泵注射',
        /* 草药方用法 */
        200 => '先煎',
        201 => '后下',
        202 => '包煎',
        203 => '另煎',
        204 => '劈开',
        205 => '打碎',
        206 => '烊化',
        207 => '泡服',
        208 => '冲服',
        209 => '煎汤代水',
        210 => '外用',
        211 => '打碎先煎',
        212 => '研磨冲服',
        213 => '包先煎',
        214 => '包后下',
        215 => '捣',
        216 => '同煎',
        217 => '水洗',
        218 => '酒洗',
        219 => '炙',
        220 => '熬',
        221 => '熏洗',
        222 => '坐浴',
        223 => '嚼服',
        224 => '灌肠',
        225 => '舌下含服',
        226 => '睡前服',
        227 => '制丸',
        228 => '制膏',
        229 => '研磨',
        230 => '制胶囊',
        231 => '另包'
    ];

    /**
     * 获取西药方用法
     * @return array
     */
    public static function getWesternUsage ()
    {
        $list = [];
        foreach (self::$message as $k => $v) {
            if ($k < 200) {
                $list[$k] = $v;
            } else {
                break;
            }
        }
        return $list;
    }

    /**
     * 获取草药方用法
     * @return array
     */
    public static function getChineseUsage ()
    {
        $list = [];
        foreach (self::$message as $k => $v) {
            if ($k > 199) {
                $list[$k] = $v;
            }
        }
        return $list;
    }

    public static function format ($code)
    {
        return isset(self::$message[$code]) ? $code : null;
    }

    public static function getMessage ($code)
    {
        return isset(self::$message[$code]) ? self::$message[$code] : $code;
    }

}
